
## Plan Result (terraform/env)

[CI link](https://github.com/team-all-in/all-in/actions/runs/10861245863)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * aws_apprunner_service.all_in_api


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_apprunner_service.all_in_api is tainted, so must be replaced
-/+ resource "aws_apprunner_service" "all_in_api" {
      ~ arn                            = "arn:aws:apprunner:ap-northeast-1:451153100141:service/all_in/0232181015204062b0fe2f6369819714" -> (known after apply)
      ~ auto_scaling_configuration_arn = "arn:aws:apprunner:ap-northeast-1:451153100141:autoscalingconfiguration/DefaultConfiguration/1/00000000000000000000000000000001" -> (known after apply)
      ~ id                             = "arn:aws:apprunner:ap-northeast-1:451153100141:service/all_in/0232181015204062b0fe2f6369819714" -> (known after apply)
      ~ service_id                     = "0232181015204062b0fe2f6369819714" -> (known after apply)
      ~ service_url                    = "mpyyzygn3p.ap-northeast-1.awsapprunner.com" -> (known after apply)
      ~ status                         = "RUNNING" -> (known after apply)
        tags                           = {
            "Name" = "all-in-apprunner-service"
        }
        # (2 unchanged attributes hidden)

      - health_check_configuration {
          - healthy_threshold   = 1 -> null
          - interval            = 5 -> null
          - path                = "/" -> null
          - protocol            = "TCP" -> null
          - timeout             = 2 -> null
          - unhealthy_threshold = 5 -> null
        }

      - instance_configuration {
          - cpu    = "1024" -> null
          - memory = "2048" -> null
        }

      - network_configuration {
          - ip_address_type = "IPV4" -> null

          - egress_configuration {
              - egress_type = "DEFAULT" -> null
            }

          - ingress_configuration {
              - is_publicly_accessible = true -> null
            }
        }

      ~ source_configuration {
            # (1 unchanged attribute hidden)

          ~ image_repository {
                # (2 unchanged attributes hidden)

              ~ image_configuration {
                  ~ port                          = "80" -> "8000"
                  - runtime_environment_secrets   = {} -> null
                  ~ runtime_environment_variables = {
                      + "SUPABASE_ANON_KEY" = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6ImNhamptc29wanp2ZXlwbXljd3FlIiwicm9sZSI6ImFub24iLCJpYXQiOjE3MjYyNDY5ODgsImV4cCI6MjA0MTgyMjk4OH0.JrXfH8vNCla4BzoWVbV6IUPOyrg5PoN239qslbb567Q"
                      + "SUPABASE_URL"      = "https://cajjmsopjzveypmycwqe.supabase.co"
                    }
                }
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":60,"Program":"tfcmt","SHA1":"21102c8459f146a16ded2305d938ebd855567a37","Target":"terraform/env","Vars":{},"WorkflowName":"pull_request_target"} -->